//#include<iostream>
//#include<vector>
//
//using namespace std;
//
//int main()
//{
//	setlocale(0, "");
//	srand(time(0));
//	int n, d{}, l{}, k{};
//	cout << "¬ведите количество свободных мест: ";
//	if ((cin >> n) and (n > 0)) {
//		int a[9][6] = { {1, 2, 3, 4, 53, 54},
//						{5, 6, 7, 8, 51, 52},
//						{9, 10, 11, 12, 49, 50},
//						{13, 14, 15, 16, 47, 48},
//						{17, 18, 19, 20, 45, 46},
//						{21, 22, 23, 24, 43, 44},
//						{25, 26, 27, 28, 41, 42},
//						{29, 30, 31, 32, 39, 40},
//						{33, 34, 35, 36, 37, 38} };
//		vector <int> b(n);
//		cout << "¬ведите места: " << endl;
//		for (int i{}; i < n; i++)
//		{
//			cin >> b[i];
//		}
//		for (int i{}; i < 9; i++)
//		{
//			for (int j{}; j < n; j++)
//			{
//				for (int k{}; k < 6; k++)
//				{
//					if (b[j] == a[i][k])
//					{
//						d++;
//					}
//				}
//			}
//			k++;
//			if ((d % 6) == 0)
//			{
//				if ((d / 6) == k)
//				{
//					if (d > l)
//					{
//						l = d;
//					}
//				}
//				else
//				{
//					d = 0;
//					k = 0;
//				}
//			}
//			else
//			{
//				k = 0;
//				d = 0;
//			}
//		}
//		cout << "ќтвет: " << l / 6;
//	}
//	else {
//		cout << "ѕерезапустите программу и введите число, большее нул€" << endl;
//	}
//	return 0;
//}