//#include<iostream>
//using namespace std;
//
//int main() {
//	setlocale(0, "");
//	int N, M;
//	cout << "¬ведите первое число: ";
//	if ((cin >> N) and (N > 0) and (N <= 75000)) {
//		cout << "¬ведите второе число: ";
//		if ((cin >> M) and (M > 0) and (M <= 75000)) {
//			cout << (N + 1) * (M + 1) * N * M / 4;
//		}
//		else {
//			cout << "ѕерезапустите программу и вводите положительные числа, не превышающие 75000";
//		}
//	}
//	else {
//		cout << "ѕерезапустите программу и вводите положительные числа, не превышающие 75000";
//	}
//	return 0;
//}